In [1]:
from sqlalchemy import create_engine

In [2]:
import pandas as pd

In [3]:
import seaborn as sns
import matplotlib.pyplot as plt

In [4]:
database_name = 'scooters'    # Fill this in with your scooter database name

connection_string = f"postgresql://postgres:postgres@localhost:5432/{database_name}"

In [5]:
database = create_engine(connection_string)

In [7]:
trips_out_of_compliance = '''
SELECT companyname, COUNT(*)
FROM trips
WHERE tripduration > 1440 OR tripduration < 1
GROUP BY companyname
'''
result = database.execute(trips_out_of_compliance)

t_oo_c = pd.read_sql(trips_out_of_compliance, con = database)
t_oo_c

     companyname  count
0           Bird   3963
1  Bolt Mobility   6908
2           Lime    661
3           Lyft   4532
4           SPIN     28